Tekla Open API Reference for Tekla Structures 2025
RebarSplice.Type Property
 The type of the splice (can be a lap, weld or muff splice).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSplice.RebarSpliceTypeEnum Type { get; set; }
Public Property Type As RebarSplice.RebarSpliceTypeEnum
	Get
	Set
Property Value
Type: RebarSplice.RebarSpliceTypeEnum
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace